In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\lenovo\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\lenovo\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import pandas as pd

In [79]:
x = {
    'Name':    ['Aya', 'Ahmed','Ali','omar'],
    'Age' :    [12,      16,    27,    30],
    'Course': ['AI',    'CS',   'UI', 'Web']
}

In [7]:
x

{'Name': ['Aya', 'Ahmed', 'Ali', 'omar'],
 'Age': [12, 16, 27, 30],
 'Course': ['AI', 'CS', 'UI', 'Web']}

In [81]:
data = pd.DataFrame(x)

In [83]:
data

    Name  Age Course
0    Aya   12     AI
1  Ahmed   16     CS
2    Ali   27     UI
3   omar   30    Web

In [282]:
data = pd.DataFrame({
    'Name':    ['Aya', 'Ahmed','Ali','omar'],
    'Age' :    [12,      40,    27,    30],
    'Course': ['AI',    'CS',   'UI', 'Web']
})

In [284]:
data

    Name  Age Course
0    Aya   12     AI
1  Ahmed   40     CS
2    Ali   27     UI
3   omar   30    Web

In [25]:
data['Name']

0      Aya
1    Ahmed
2      Ali
3     omar
Name: Name, dtype: object

In [27]:
data['Age']

0    12
1    16
2    27
3    30
Name: Age, dtype: int64

In [29]:
type(data['Age'])

pandas.core.series.Series

In [31]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [35]:
#create dataframe

df1 = pd.DataFrame({
    'Name':    ['Aya', 'Ahmed','Ali','omar'],
    'Age' :    [12,      16,    27,    30],
    'Course': ['AI',    'CS',   'UI', 'Web']
})
df1

    Name  Age Course
0    Aya   12     AI
1  Ahmed   16     CS
2    Ali   27     UI
3   omar   30    Web

In [37]:
#create dataframe

df2 = pd.DataFrame({
    'Name':    ['nada', 'mohamed','bob','basma'],
    'Age' :    [12,      16,    27,    30],
    'Course': ['AI',    'CS',   'UI', 'Web']
})
df2

      Name  Age Course
0     nada   12     AI
1  mohamed   16     CS
2      bob   27     UI
3    basma   30    Web

In [43]:
# concat 2 dataframes
new_df = pd.concat([df1,df2], ignore_index = True)

In [45]:
new_df

      Name  Age Course
0      Aya   12     AI
1    Ahmed   16     CS
2      Ali   27     UI
3     omar   30    Web
4     nada   12     AI
5  mohamed   16     CS
6      bob   27     UI
7    basma   30    Web

In [49]:
df1

    Name  Age Course
0    Aya   12     AI
1  Ahmed   16     CS
2    Ali   27     UI
3   omar   30    Web

In [47]:
#create dataframe

df3 = pd.DataFrame({
    'Name':    ['nada', 'mohamed','bob','basma'],
    'stud_Age' :    [12,      16,    27,    30],
    'stud_Course': ['AI',    'CS',   'UI', 'Web']
})
df3

      Name  stud_Age stud_Course
0     nada        12          AI
1  mohamed        16          CS
2      bob        27          UI
3    basma        30         Web

In [51]:
# concat 2 dataframes
new_df2 = pd.concat([df1,df3], ignore_index = True)
new_df2

      Name   Age Course  stud_Age stud_Course
0      Aya  12.0     AI       NaN         NaN
1    Ahmed  16.0     CS       NaN         NaN
2      Ali  27.0     UI       NaN         NaN
3     omar  30.0    Web       NaN         NaN
4     nada   NaN    NaN      12.0          AI
5  mohamed   NaN    NaN      16.0          CS
6      bob   NaN    NaN      27.0          UI
7    basma   NaN    NaN      30.0         Web

In [60]:
df= pd.DataFrame({
    'col1': ['a','b','c'],
    'col2': ['d','z','n']},   index  = [1,2,3])

In [62]:
df

  col1 col2
1    a    d
2    b    z
3    c    n

In [64]:
df= pd.DataFrame({
    'col1': ['a','b','c'],
    'col2': ['d','z','n']},   index  = range(1,4))
df

  col1 col2
1    a    d
2    b    z
3    c    n

In [66]:
df= pd.DataFrame({
    'col1': ['a','b','c'],
    'col2': ['d','z','n']},   index  =['one','two','three'])
df

      col1 col2
one      a    d
two      b    z
three    c    n

In [85]:
b = [[1,2,3],[4,5,6],[7,8,9]]

In [87]:
b

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [89]:
pd.DataFrame(b)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [91]:
pd.DataFrame(b,columns = ['col1','col2','col3'])

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

In [105]:
df1 = pd.DataFrame({
    'A':    ['A0', 'A1','A2'],
    'B' :    ['B0', 'B1','B2'],
    'Key': ['K0','K1','K2']
})
df1

    A   B Key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2

In [107]:
df2 = pd.DataFrame({
    'C':    ['C0', 'C1','C2'],
    'D' :    ['D0', 'D1','D2'],
    'Key': ['K0','K1','K3']
})
df2

    C   D Key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K3

In [109]:
resluts = pd.merge(df1,df2, on = 'Key')

In [111]:
resluts

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1

In [113]:
resluts = pd.merge(df1,df2, on = 'Key',how = 'left')

In [115]:
resluts

    A   B Key    C    D
0  A0  B0  K0   C0   D0
1  A1  B1  K1   C1   D1
2  A2  B2  K2  NaN  NaN

In [141]:
#create dataframe
df = pd.DataFrame({
    'Name':    ['nada', 'mohamed','bob','basma'],
    'Age_of_student' :    [12,      16,    12,    30],
    'Course': ['AI',    'CS',   'UI', 'Web']
})
df

      Name  Age_of_student Course
0     nada              12     AI
1  mohamed              16     CS
2      bob              12     UI
3    basma              30    Web

In [143]:
df['Age_of_student'].value_counts()

Age_of_student
12    2
16    1
30    1
Name: count, dtype: int64

In [145]:
df.Age_of_student.value_counts()

Age_of_student
12    2
16    1
30    1
Name: count, dtype: int64

In [149]:
df.Age_of_student.unique()

array([12, 16, 30], dtype=int64)

In [151]:
df.Age_of_student.nunique()

3

In [153]:
data

    Name  Age Course
0    Aya   12     AI
1  Ahmed   16     CS
2    Ali   27     UI
3   omar   30    Web

In [155]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Course  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [157]:
data.describe() # detailed des about data --> Numerical cols

             Age
count   4.000000
mean   21.250000
std     8.616844
min    12.000000
25%    15.000000
50%    21.500000
75%    27.750000
max    30.000000

In [159]:
len(data) # num of rows

4

In [161]:
data.shape  #(rows, cols)

(4, 3)

In [183]:
data

    Name  Age Course
0    Aya   12     AI
1  Ahmed   16     CS
2    Ali   27     UI
3   omar   30    Web

In [177]:
new_data = data[data.Age > 15]
new_data

    Name  Age Course
1  Ahmed   16     CS
2    Ali   27     UI
3   omar   30    Web

In [191]:
new_data = data[(data.Age > data.Age.min()) & (data.Age < data.Age.max())]
new_data

    Name  Age Course
1  Ahmed   16     CS
2    Ali   27     UI

In [195]:
new_data = data[(data.Age > 15) & (data.Course == 'UI') ]
new_data

  Name  Age Course
2  Ali   27     UI

In [197]:
data.Name

0      Aya
1    Ahmed
2      Ali
3     omar
Name: Name, dtype: object

In [201]:
data.iloc[0]  #access by row

Name      Aya
Age        12
Course     AI
Name: 0, dtype: object

In [203]:
type(data)

pandas.core.frame.DataFrame

In [205]:
data.iloc[0:2]

    Name  Age Course
0    Aya   12     AI
1  Ahmed   16     CS

In [207]:
data

    Name  Age Course
0    Aya   12     AI
1  Ahmed   16     CS
2    Ali   27     UI
3   omar   30    Web

In [221]:
#rename columns 
data = data.rename({'Course':'Student Course'},axis = 1)

In [223]:
data

    Name  Age Student Course
0    Aya   12             AI
1  Ahmed   16             CS
2    Ali   27             UI
3   omar   30            Web

In [225]:
data

    Name  Age Student Course
0    Aya   12             AI
1  Ahmed   16             CS
2    Ali   27             UI
3   omar   30            Web

In [247]:
data.sort_values(['Age'],ascending = False ,inplace = True)

In [249]:
data

    Name  Age Course
1  Ahmed   40     CS
3   omar   30    Web
2    Ali   27     UI
0    Aya   12     AI

In [286]:
data.reset_index(inplace = True)

In [288]:
data

   index   Name  Age Course
0      0    Aya   12     AI
1      1  Ahmed   40     CS
2      2    Ali   27     UI
3      3   omar   30    Web

In [290]:
data.drop(columns= ['index','Name'],axis = 1,inplace = True)

In [292]:
data

   Age Course
0   12     AI
1   40     CS
2   27     UI
3   30    Web

In [479]:
df = pd.DataFrame({
    'Name' : ['Aya','Ahmed','Omar','Alic','bob','ofjgho'],
    'Age' : [25,24,22,26,20,88],
    'Salary': [10000, 20000,34000,50000,45000,666],
    'Gender': ['F','M','M','F','M','F'],
    'Annual_Income': [120000,300000,1000000,450000,700000,7677]
    
})

In [481]:
df

     Name  Age  Salary Gender  Annual_Income
0     Aya   25   10000      F         120000
1   Ahmed   24   20000      M         300000
2    Omar   22   34000      M        1000000
3    Alic   26   50000      F         450000
4     bob   20   45000      M         700000
5  ofjgho   88     666      F           7677

In [483]:
'''
1- Info about data [all data & numrical data]
2- how many males and females in you data
3- add column ['Bouns'] --> random bouns for each employee
4- rename ['Salary'] --> ['Income']
5- replace value M --> Male , F --> Female
6- sort Income column values
'''

"\n1- Info about data [all data & numrical data]\n2- how many males and females in you data\n3- add column ['Bouns'] --> random bouns for each employee\n4- rename ['Salary'] --> ['Income']\n5- replace value M --> Male , F --> Female\n6- sort Income column values\n"

In [485]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           6 non-null      object
 1   Age            6 non-null      int64
 2   Salary         6 non-null      int64
 3   Gender         6 non-null      object
 4   Annual_Income  6 non-null      int64
dtypes: int64(3), object(2)
memory usage: 372.0+ bytes

In [487]:
df.describe()

             Age        Salary   Annual_Income
count   6.000000      6.000000        6.000000
mean   34.166667  26611.000000   429612.833333
std    26.460663  19659.967599   371363.923111
min    20.000000    666.000000     7677.000000
25%    22.500000  12500.000000   165000.000000
50%    24.500000  27000.000000   375000.000000
75%    25.750000  42250.000000   637500.000000
max    88.000000  50000.000000  1000000.000000

In [489]:
df.Gender.value_counts()

Gender
F    3
M    3
Name: count, dtype: int64

In [491]:
import numpy as np

In [493]:
len(df)

6

In [495]:
np.random.randint(500,3000, size = len(df))

array([1004, 1825, 2836, 2998, 2603, 2601])

In [497]:
df['Bouns'] = np.random.randint(500,3000, size = len(df))

In [499]:
df

     Name  Age  Salary Gender  Annual_Income  Bouns
0     Aya   25   10000      F         120000   1168
1   Ahmed   24   20000      M         300000   2888
2    Omar   22   34000      M        1000000    970
3    Alic   26   50000      F         450000   1348
4     bob   20   45000      M         700000   1392
5  ofjgho   88     666      F           7677   1688

In [500]:
df.rename({'Salary':'Income'},axis = 1,inplace = True)

In [501]:
df

     Name  Age  Income Gender  Annual_Income  Bouns
0     Aya   25   10000      F         120000   1168
1   Ahmed   24   20000      M         300000   2888
2    Omar   22   34000      M        1000000    970
3    Alic   26   50000      F         450000   1348
4     bob   20   45000      M         700000   1392
5  ofjgho   88     666      F           7677   1688

In [502]:
df['Gender'] = df['Gender'].replace('M','Male')

In [503]:
df['Gender'] = df['Gender'].replace('F','Female')

In [504]:
df

     Name  Age  Income  Gender  Annual_Income  Bouns
0     Aya   25   10000  Female         120000   1168
1   Ahmed   24   20000    Male         300000   2888
2    Omar   22   34000    Male        1000000    970
3    Alic   26   50000  Female         450000   1348
4     bob   20   45000    Male         700000   1392
5  ofjgho   88     666  Female           7677   1688

In [505]:
df.sort_values(['Income'],ascending = False ,inplace = True)

In [506]:
df

     Name  Age  Income  Gender  Annual_Income  Bouns
3    Alic   26   50000  Female         450000   1348
4     bob   20   45000    Male         700000   1392
2    Omar   22   34000    Male        1000000    970
1   Ahmed   24   20000    Male         300000   2888
0     Aya   25   10000  Female         120000   1168
5  ofjgho   88     666  Female           7677   1688

In [507]:
df.sort_index(inplace = True)

In [510]:
df

     Name  Age  Income  Gender  Annual_Income  Bouns
0     Aya   25   10000  Female         120000   1168
1   Ahmed   24   20000    Male         300000   2888
2    Omar   22   34000    Male        1000000    970
3    Alic   26   50000  Female         450000   1348
4     bob   20   45000    Male         700000   1392
5  ofjgho   88     666  Female           7677   1688

In [511]:
df.sort_values(['Gender','Age'],ascending = True ,inplace = True)

In [512]:
df

     Name  Age  Income  Gender  Annual_Income  Bouns
0     Aya   25   10000  Female         120000   1168
3    Alic   26   50000  Female         450000   1348
5  ofjgho   88     666  Female           7677   1688
4     bob   20   45000    Male         700000   1392
2    Omar   22   34000    Male        1000000    970
1   Ahmed   24   20000    Male         300000   2888

In [513]:
df.reset_index(inplace = True)
df.drop(columns = 'index',inplace = True)

In [514]:
df

     Name  Age  Income  Gender  Annual_Income  Bouns
0     Aya   25   10000  Female         120000   1168
1    Alic   26   50000  Female         450000   1348
2  ofjgho   88     666  Female           7677   1688
3     bob   20   45000    Male         700000   1392
4    Omar   22   34000    Male        1000000    970
5   Ahmed   24   20000    Male         300000   2888

In [515]:
df['Income'].max()

50000

In [534]:
df['Income'].min()

666

In [536]:
df['Gender'].min()

'Female'

In [538]:
df['Gender'].max()

'Male'